package com.javarush.telegrambot;

public class TelegramBotContent {
    public static final String STEP_1_TEXT = """
            *ПРИВЕТСТВУЕМ НА ПЕРВОМ УРОВНЕ!*
                                                                 \s
            Ты просыпаешься и понимаешь, что ты — кот. Утро доброе, но что это за удивительные чувства? Твой живот бурчит от сильного голода. Еды в квартире нет, разве что в закрытом холодильнике. Что же делать?
           \s
            Прийдется вспомнить, как хакать цифровой холодильник. Открываем книжку "Продвинутый хакинг для Котов":
           \s
                1. Выполни первое задание, а потом переверни страницу!
                2. Прокачайся и переходи к самому интересному!
                3. Сделай дела, чтобы заслужить уважение среди всех местных котов!
           \s
            *Кот домашний обыкновенус, уровень первый.*
            Взломай цифровой холодильник и выполни первое задание!
           \s""";

    public static final String STEP_2_TEXT = """
            *ПРИВЕТСТВУЕМ НА ВТОРОМ УРОВНЕ!*
                                 \s
            Юху! Ты одолел холодильник. Ты получаешь +20 славы!
           \s
            _Накоплено: 20 славы._
           \s
            Выбирай свою награду:
           \s""";

    public static final String STEP_3_TEXT = """
            *Кот Айтишник, уровень второй.*
            Неожиданно, из-за угла выполз жужжащий робот-пылесос. Настало время мести!
            Выполни второе задание и взломай его!
            """;

    public static final String STEP_4_TEXT = """
            *ПРИВЕТСТВУЕМ НА ТРЕТЬЕМ УРОВНЕ!*
                                   \s
            Ты справился с робопылесосом! Ты получаешь +30 славы!
                                     \s
            _Накоплено: 70 славы._
           \s
            Выбирай свою награду:
           \s""";

    public static final String STEP_5_TEXT = """
            *Кот Робоукротитель, уровень третий.*
            Хо-хо! На шкафу обнаружен ничейный GoPro!
            Выполни третье задание — надень и включи его!
            """;

    public static final String STEP_6_TEXT = """
            *ПРИВЕТСТВУЕМ НА ЧЕТВЕРТОМ УРОВНЕ!*
                                   \s
            Ты надел GoPro! Ты получаешь +40 славы!
                                   \s
            _Накоплено: 140 славы._
           \s
            Выбирай свою награду:
           \s""";

    public static final String STEP_7_TEXT = """
            *Кот Видеоблогер, уровень четвертый.*
            Теперь отснятый материал нужно залить на компьютер.
            Выполни четвертое задание — взломай пароль от компьютера!
            """;

    public static final String STEP_8_TEXT = """
            *ПРИВЕТСТВУЕМ НА ПЯТОМ УРОВНЕ!*
            
            Ты одолел компьютер! Ты получаешь +50 славы!
            
            _Накоплено: 230 славы._
            """;

    public static final String FINAL_TEXT = """
            *Кот Хакер, уровень пятый.*
            День прошел не зря: кот-хакер выполнил свою миссию и заслужил уважение среди местных дворовых котов.
            """;
}
